# Source Documentation

https://dev.mysql.com/doc/refman/8.0/en/creating-database.html

# Import Library

In [1]:
import mysql.connector as sql


# Create SQL Connection

In [2]:
connection = sql.connect(
 host="localhost",
 user="root",
 #password=""
)

print(connection)

<mysql.connector.connection.MySQLConnection object at 0x10a7dce50>

# Database

#### Creating Database Student

In [3]:
cursor = connection.cursor()

#cursor.execute("CREATE DATABASE menagerie")

#### Read All Databases

In [4]:
cursor = connection.cursor()

cursor.execute("SHOW DATABASES")

for database in cursor:
    print(database)

('information_schema',)
('menagerie',)
('mysql',)
('performance_schema',)

#### Read spesific database

In [5]:
# connect with student database
connection = sql.connect(
 host="localhost",
 user="root",
 #password=""
 database='menagerie'
)

print(connection)

<mysql.connector.connection.MySQLConnection object at 0x10ac1f490>

#### Drop Database

In [6]:
#cursor.execute("DROP DATABASE menagerie")

# Table

#### read All tables

In [7]:
cursor = connection.cursor()

cursor.execute("SHOW TABLES")

for database in cursor:
    print(database)

#### Create Table in MySQL

In [8]:
cursor = connection.cursor()

cursor.execute("CREATE TABLE pet(id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(20),  owner VARCHAR(20), species VARCHAR(20), sex CHAR(1), birth VARCHAR(20), death VARCHAR(20))")

### Create Records in Table

In [9]:
query = "INSERT INTO pet (name, owner, species, sex, birth, death) VALUES(%s,%s,%s,%s,%s,%s)"
value = ('Puffball','Diane','hamster','f','1999-03-30','')
cursor.execute(query, value)
# Execute statement
connection.commit()

print("Row inserted", cursor.lastrowid)

Row inserted 1

### Read All

In [10]:
cursor = connection.cursor()

cursor.execute("SELECT * from pet")

# Fetch all the Data
cursor.fetchall()

[(1, 'Puffball', 'Diane', 'hamster', 'f', '1999-03-30', '')]

### Create Multiple records in Table

In [11]:
query = "INSERT INTO pet (name, owner, species, sex, birth, death) VALUES(%s,%s,%s,%s,%s,%s)"
values = [('Fluffy', 'Harold', 'cat', 'f', '1993-02-04', 'NULL'),
          ('Claws', 'Gwen', 'cat', 'm', '1994-03-17', 'NULL'),
          ('Buffy', 'Harold', 'dog', 'f', '1989-05-13', 'NULL'),
          ('Fang', 'Benny', 'dog', 'm',  '1990-08-27', 'NULL'),
          ('Bowser', 'Diane', 'dog', 'm', '1979-08-31', '1995-07-29'),
          ('Chirpy', 'Gwen', 'bird', 'f','1998-09-11', 'NULL'),
          ('Whistler', 'Gwen', 'bird', 'm', '1997-12-09', 'NULL'),
          ('Slim', 'Benny', 'snake', 'm', '1996-04-29', 'NULL')
         ]
cursor.executemany(query,values)
# Execute statement
connection.commit()

print("Row inserted",cursor.lastrowid)

Row inserted 2

### Read All

In [12]:
cursor = connection.cursor()

cursor.execute("SELECT * FROM pet")

# Fetch data
cursor.fetchall()

[(1, 'Puffball', 'Diane', 'hamster', 'f', '1999-03-30', ''),
 (2, 'Fluffy', 'Harold', 'cat', 'f', '1993-02-04', 'NULL'),
 (3, 'Claws', 'Gwen', 'cat', 'm', '1994-03-17', 'NULL'),
 (4, 'Buffy', 'Harold', 'dog', 'f', '1989-05-13', 'NULL'),
 (5, 'Fang', 'Benny', 'dog', 'm', '1990-08-27', 'NULL'),
 (6, 'Bowser', 'Diane', 'dog', 'm', '1979-08-31', '1995-07-29'),
 (7, 'Chirpy', 'Gwen', 'bird', 'f', '1998-09-11', 'NULL'),
 (8, 'Whistler', 'Gwen', 'bird', 'm', '1997-12-09', 'NULL'),
 (9, 'Slim', 'Benny', 'snake', 'm', '1996-04-29', 'NULL')]

### Read Particular Rows

In [13]:
# what_to_select(SELECT), which_table(FROM), conditions_to_satisfy(WHERE)
cursor.execute("SELECT * FROM pet WHERE name='Fluffy' ")

# Fetch data
cursor.fetchall()

[(2, 'Fluffy', 'Harold', 'cat', 'f', '1993-02-04', 'NULL')]

In [14]:
# what_to_select(SELECT), which_table(FROM), conditions_to_satisfy(WHERE)
cursor.execute("SELECT * FROM pet WHERE birth >= '1998-01-01' ")

# Fetch data
cursor.fetchall()

[(1, 'Puffball', 'Diane', 'hamster', 'f', '1999-03-30', ''),
 (7, 'Chirpy', 'Gwen', 'bird', 'f', '1998-09-11', 'NULL')]

In [15]:
# what_to_select(SELECT), which_table(FROM), conditions_to_satisfy(WHERE)
cursor.execute("SELECT * FROM pet WHERE species='dog' AND sex='f' ")

# Fetch data
cursor.fetchall()

[(4, 'Buffy', 'Harold', 'dog', 'f', '1989-05-13', 'NULL')]

In [16]:
cursor.execute("SELECT * FROM pet WHERE species='bird' OR species='snake'")

# Fetch data
cursor.fetchall()

[(7, 'Chirpy', 'Gwen', 'bird', 'f', '1998-09-11', 'NULL'),
 (8, 'Whistler', 'Gwen', 'bird', 'm', '1997-12-09', 'NULL'),
 (9, 'Slim', 'Benny', 'snake', 'm', '1996-04-29', 'NULL')]

In [17]:
cursor.execute("SELECT * FROM pet WHERE (species='cat' AND sex='m') OR (species='dog' AND sex='f')")

# Fetch data
cursor.fetchall()

[(3, 'Claws', 'Gwen', 'cat', 'm', '1994-03-17', 'NULL'),
 (4, 'Buffy', 'Harold', 'dog', 'f', '1989-05-13', 'NULL')]

### Read Particular Columns

In [18]:
cursor.execute("SELECT name,birth FROM pet")

# Fetch data
cursor.fetchall()

[('Puffball', '1999-03-30'),
 ('Fluffy', '1993-02-04'),
 ('Claws', '1994-03-17'),
 ('Buffy', '1989-05-13'),
 ('Fang', '1990-08-27'),
 ('Bowser', '1979-08-31'),
 ('Chirpy', '1998-09-11'),
 ('Whistler', '1997-12-09'),
 ('Slim', '1996-04-29')]

In [19]:
cursor.execute("SELECT owner FROM pet")

# Fetch data
cursor.fetchall()

[('Diane',),
 ('Harold',),
 ('Gwen',),
 ('Harold',),
 ('Benny',),
 ('Diane',),
 ('Gwen',),
 ('Gwen',),
 ('Benny',)]

In [20]:
cursor.execute("SELECT name,species,birth FROM pet WHERE species='dog' OR species='cat'")

# Fetch data
cursor.fetchall()

[('Fluffy', 'cat', '1993-02-04'),
 ('Claws', 'cat', '1994-03-17'),
 ('Buffy', 'dog', '1989-05-13'),
 ('Fang', 'dog', '1990-08-27'),
 ('Bowser', 'dog', '1979-08-31')]

### Read Distinct Columns

In [21]:
cursor.execute("SELECT DISTINCT owner from pet")

# Fetch data
cursor.fetchall()

[('Diane',), ('Harold',), ('Gwen',), ('Benny',)]

### Sorting Rows

In [22]:
cursor.execute("SELECT name,birth FROM pet ORDER BY birth")

#fetch data
cursor.fetchall()

[('Bowser', '1979-08-31'),
 ('Buffy', '1989-05-13'),
 ('Fang', '1990-08-27'),
 ('Fluffy', '1993-02-04'),
 ('Claws', '1994-03-17'),
 ('Slim', '1996-04-29'),
 ('Whistler', '1997-12-09'),
 ('Chirpy', '1998-09-11'),
 ('Puffball', '1999-03-30')]

In [23]:
cursor.execute("SELECT name,birth FROM pet ORDER BY birth DESC")

#fetch data
cursor.fetchall()

[('Puffball', '1999-03-30'),
 ('Chirpy', '1998-09-11'),
 ('Whistler', '1997-12-09'),
 ('Slim', '1996-04-29'),
 ('Claws', '1994-03-17'),
 ('Fluffy', '1993-02-04'),
 ('Fang', '1990-08-27'),
 ('Buffy', '1989-05-13'),
 ('Bowser', '1979-08-31')]

In [24]:
cursor.execute("SELECT name,species,birth FROM pet ORDER BY species,birth DESC")

#fetch data
cursor.fetchall()

[('Chirpy', 'bird', '1998-09-11'),
 ('Whistler', 'bird', '1997-12-09'),
 ('Claws', 'cat', '1994-03-17'),
 ('Fluffy', 'cat', '1993-02-04'),
 ('Fang', 'dog', '1990-08-27'),
 ('Buffy', 'dog', '1989-05-13'),
 ('Bowser', 'dog', '1979-08-31'),
 ('Puffball', 'hamster', '1999-03-30'),
 ('Slim', 'snake', '1996-04-29')]

#### Data Calculations

In [25]:
cursor.execute("SELECT name, birth, CURDATE(), TIMESTAMPDIFF(YEAR, birth, CURDATE()) AS age FROM pet")

#fetch data
cursor.fetchall()

[('Puffball', '1999-03-30', datetime.date(2021, 9, 26), 22),
 ('Fluffy', '1993-02-04', datetime.date(2021, 9, 26), 28),
 ('Claws', '1994-03-17', datetime.date(2021, 9, 26), 27),
 ('Buffy', '1989-05-13', datetime.date(2021, 9, 26), 32),
 ('Fang', '1990-08-27', datetime.date(2021, 9, 26), 31),
 ('Bowser', '1979-08-31', datetime.date(2021, 9, 26), 42),
 ('Chirpy', '1998-09-11', datetime.date(2021, 9, 26), 23),
 ('Whistler', '1997-12-09', datetime.date(2021, 9, 26), 23),
 ('Slim', '1996-04-29', datetime.date(2021, 9, 26), 25)]

In [26]:
cursor.execute("SELECT name,birth, CURDATE(), TIMESTAMPDIFF(YEAR, birth, CURDATE()) AS age FROM pet ORDER BY name")

#fetch data
cursor.fetchall()

[('Bowser', '1979-08-31', datetime.date(2021, 9, 26), 42),
 ('Buffy', '1989-05-13', datetime.date(2021, 9, 26), 32),
 ('Chirpy', '1998-09-11', datetime.date(2021, 9, 26), 23),
 ('Claws', '1994-03-17', datetime.date(2021, 9, 26), 27),
 ('Fang', '1990-08-27', datetime.date(2021, 9, 26), 31),
 ('Fluffy', '1993-02-04', datetime.date(2021, 9, 26), 28),
 ('Puffball', '1999-03-30', datetime.date(2021, 9, 26), 22),
 ('Slim', '1996-04-29', datetime.date(2021, 9, 26), 25),
 ('Whistler', '1997-12-09', datetime.date(2021, 9, 26), 23)]

In [27]:
cursor.execute("SELECT name,birth, CURDATE(), TIMESTAMPDIFF(YEAR, birth, CURDATE()) AS age FROM pet ORDER BY age")

#fetch data
cursor.fetchall()

[('Puffball', '1999-03-30', datetime.date(2021, 9, 26), 22),
 ('Chirpy', '1998-09-11', datetime.date(2021, 9, 26), 23),
 ('Whistler', '1997-12-09', datetime.date(2021, 9, 26), 23),
 ('Slim', '1996-04-29', datetime.date(2021, 9, 26), 25),
 ('Claws', '1994-03-17', datetime.date(2021, 9, 26), 27),
 ('Fluffy', '1993-02-04', datetime.date(2021, 9, 26), 28),
 ('Fang', '1990-08-27', datetime.date(2021, 9, 26), 31),
 ('Buffy', '1989-05-13', datetime.date(2021, 9, 26), 32),
 ('Bowser', '1979-08-31', datetime.date(2021, 9, 26), 42)]

In [28]:
cursor.execute("SELECT name, birth, death, TIMESTAMPDIFF(YEAR,birth,death) AS age FROM pet WHERE death IS NOT NULL ORDER BY age")

#fetch data
cursor.fetchall()

[('Puffball', '1999-03-30', '', None),
 ('Fluffy', '1993-02-04', 'NULL', None),
 ('Claws', '1994-03-17', 'NULL', None),
 ('Buffy', '1989-05-13', 'NULL', None),
 ('Fang', '1990-08-27', 'NULL', None),
 ('Chirpy', '1998-09-11', 'NULL', None),
 ('Whistler', '1997-12-09', 'NULL', None),
 ('Slim', '1996-04-29', 'NULL', None),
 ('Bowser', '1979-08-31', '1995-07-29', 15)]

In [29]:
cursor.execute("SELECT name,birth, MONTH(birth) FROM pet")

#fetch data
cursor.fetchall()

[('Puffball', '1999-03-30', 3),
 ('Fluffy', '1993-02-04', 2),
 ('Claws', '1994-03-17', 3),
 ('Buffy', '1989-05-13', 5),
 ('Fang', '1990-08-27', 8),
 ('Bowser', '1979-08-31', 8),
 ('Chirpy', '1998-09-11', 9),
 ('Whistler', '1997-12-09', 12),
 ('Slim', '1996-04-29', 4)]

In [30]:
cursor.execute("SELECT name,birth, MONTH(birth) FROM pet WHERE MONTH(birth)='5'")

#fetch data
cursor.fetchall()

[('Buffy', '1989-05-13', 5)]

#### Pattern matching

In [31]:
cursor.execute("SELECT * FROM pet WHERE name LIKE 'B%'")

#fetch data
cursor.fetchall()

[(4, 'Buffy', 'Harold', 'dog', 'f', '1989-05-13', 'NULL'),
 (6, 'Bowser', 'Diane', 'dog', 'm', '1979-08-31', '1995-07-29')]

mencari pattern nama dengan huruf depan 'B'

In [32]:
cursor.execute("SELECT * FROM pet WHERE name LIKE '%fy'")

#fecth data
cursor.fetchall()

[(2, 'Fluffy', 'Harold', 'cat', 'f', '1993-02-04', 'NULL'),
 (4, 'Buffy', 'Harold', 'dog', 'f', '1989-05-13', 'NULL')]

mencari pattern nama dengan huruf belakang 'fy'

In [33]:
cursor.execute("SELECT * FROM pet WHERE name LIKE '%w%' ")

#fetch data
cursor.fetchall()

[(3, 'Claws', 'Gwen', 'cat', 'm', '1994-03-17', 'NULL'),
 (6, 'Bowser', 'Diane', 'dog', 'm', '1979-08-31', '1995-07-29'),
 (8, 'Whistler', 'Gwen', 'bird', 'm', '1997-12-09', 'NULL')]

mencari pattern nama yang mengandung huruf 'w'

In [34]:
cursor.execute("SELECT * FROM pet WHERE name LIKE '_____' ")

#fetch data
cursor.fetchall()

[(3, 'Claws', 'Gwen', 'cat', 'm', '1994-03-17', 'NULL'),
 (4, 'Buffy', 'Harold', 'dog', 'f', '1989-05-13', 'NULL')]

mencari pattern nama yang terdiri dari lima karakter '_____'

#### Counting Rows

In [35]:
cursor.execute("SELECT COUNT(*) FROM pet")

#fetchdata
cursor.fetchall()

[(9,)]

In [36]:
cursor.execute("SELECT owner, COUNT(*) FROM pet GROUP BY owner")

#fetch data
cursor.fetchall()

[('Diane', 2), ('Harold', 2), ('Gwen', 3), ('Benny', 2)]

menghitung berapa banyak pemilik memiliki hewan peliharaan

In [37]:
cursor.execute("SELECT species, COUNT(*) FROM pet GROUP BY species")

#fetch data
cursor.fetchall()

[('hamster', 1), ('cat', 2), ('dog', 3), ('bird', 2), ('snake', 1)]

menghitung ada berapa species per hewan

In [38]:
cursor.execute("SELECT sex, COUNT(*) FROM pet GROUP BY sex")

#fetch data
cursor.fetchall()

[('f', 4), ('m', 5)]

menghitung ada brapa species per sex

In [39]:
cursor.execute("SELECT species,sex, COUNT(*) FROM pet GROUP BY species,sex")

#fetch data
cursor.fetchall()

[('hamster', 'f', 1),
 ('cat', 'f', 1),
 ('cat', 'm', 1),
 ('dog', 'f', 1),
 ('dog', 'm', 2),
 ('bird', 'f', 1),
 ('bird', 'm', 1),
 ('snake', 'm', 1)]

menghitung jumlah hewan per kombinasi dari species dan sex

In [40]:
cursor.execute("SELECT species,sex, COUNT(*) FROM pet WHERE species='dog' OR species='cat' GROUP BY species,sex")

#fetch data
cursor.fetchall()

[('cat', 'f', 1), ('cat', 'm', 1), ('dog', 'f', 1), ('dog', 'm', 2)]

menghitung jumlah hewan per kombinasi dari species dan sex untuk anjing dan kucing

In [41]:
cursor.execute("SELECT species,sex, COUNT(*) FROM pet WHERE sex IS NOT NULL GROUP BY species,sex")

#fetch data
cursor.fetchall()

[('hamster', 'f', 1),
 ('cat', 'f', 1),
 ('cat', 'm', 1),
 ('dog', 'f', 1),
 ('dog', 'm', 2),
 ('bird', 'f', 1),
 ('bird', 'm', 1),
 ('snake', 'm', 1)]

melihat hewan yang hanya diketahui jenis kelaminnya

### Using Using More Than one Table (INNER JOIN)

#### create new table

In [42]:
cursor.execute("CREATE TABLE event (name VARCHAR(20), date VARCHAR(20), type VARCHAR(15), remark VARCHAR(255))")

#### create multiple records in table event

In [43]:
query = "INSERT INTO event (name, date, type, remark) VALUES(%s,%s,%s,%s)"
values = [("Fluffy", "1995-05-15", "litter", "4 kittens, 3 female, 1 male"),
          ("Buffy", "1993-06-23", "litter", "5 puppies, 2 female, 3 male"),
          ("Buffy", "1994-06-19", "litter", "3 puppies, 3 female"),
          ("Chirpy", "1999-03-21", "vet", "needed beak straightened"),
          ("Slim", "1997-08-03", "vet", "broken rib"),
          ("Bowser", "1991-10-12", "kennel", " "),
          ("Fang", "1991-10-12", "kennel", " "),
          ("Fang", "1998-08-28", "birthday", "Gave him a new chew toy"),
          ("Whistler", "1998-12-09", "birthday", "First birthday")
         ]
cursor.executemany(query,values)
# Execute statement
connection.commit()

print("Row inserted",cursor.lastrowid)

Row inserted 0

#### read all table event

In [44]:
cursor = connection.cursor()

cursor.execute("SELECT * FROM event")

# Fetch data
cursor.fetchall()

[('Fluffy', '1995-05-15', 'litter', '4 kittens, 3 female, 1 male'),
 ('Buffy', '1993-06-23', 'litter', '5 puppies, 2 female, 3 male'),
 ('Buffy', '1994-06-19', 'litter', '3 puppies, 3 female'),
 ('Chirpy', '1999-03-21', 'vet', 'needed beak straightened'),
 ('Slim', '1997-08-03', 'vet', 'broken rib'),
 ('Bowser', '1991-10-12', 'kennel', ' '),
 ('Fang', '1991-10-12', 'kennel', ' '),
 ('Fang', '1998-08-28', 'birthday', 'Gave him a new chew toy'),
 ('Whistler', '1998-12-09', 'birthday', 'First birthday')]

#### INNER JOIN

In [45]:
cursor.execute("SELECT pet.name, TIMESTAMPDIFF(YEAR, birth, date) AS age, remark from pet INNER JOIN event ON pet.name = event.name WHERE event.type = 'litter' ")

#fetch data
cursor.fetchall()

[('Fluffy', 2, '4 kittens, 3 female, 1 male'),
 ('Buffy', 5, '3 puppies, 3 female'),
 ('Buffy', 4, '5 puppies, 2 female, 3 male')]

### Update Records in Table

In [46]:
cursor.execute("UPDATE pet SET birth='1989-08-31' WHERE name='Bowser'")

### Delete Records in Table

In [47]:
#cursor.execute("DELETE FROM pet WHERE name='Bowser'")

### Drop Table

#### Drop Table

In [48]:
#cursor.execute("DROP TABLE pet")